Tekla Open API Reference for Tekla Structures 2025
Point Fields
The Point type exposes the following members.
Fields
Name | Description
EPSILON_SQUARED
 A boundary value for comparing if two points are similar.
HASH_SEED
 A default seed value for creating hash codes.
X
 The X-coordinate of the point.
Y
 The Y-coordinate of the point.
Z
 The Z-coordinate of the point.
Top
See Also
Reference
Point Class
Tekla.Structures.Geometry3d Namespace